snlkuharlocal/src/DataProcessors/КонтрольОбъемовЗОГ/КонтрольОбъемовЗОГ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтрольОбъемовЗОГ</name>
</mdclass:DataProcessor>

snlkuharlocal/src/Documents/ЗаявкаНаОтгрузку/ЗаявкаНаОтгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаОтгрузку</name>
  <basedOn>Document.ЗаявкаНаОтгрузку</basedOn>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОтгрузку</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаявки</name>
    <type>
      <types>EnumRef.ВидыЗавокНаОтргузку</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Отправитель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставкиОтправитель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортнаяКомпанияОтправитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктПерегрузаОтправитель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставкиПолучатель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортнаяКомпанияПолучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктПерегрузаПолучатель</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладной</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.Автомобили</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РайонДоставкиПолучатель</name>
      <type>
        <types>CatalogRef.РайоныДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеНакладной</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
    <attributes>
      <name>Доставлена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеОтгружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресОтправитель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПолучатель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.РасходМатериаловИТары</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДоставки</name>
      <type>
        <types>EnumRef.ТипыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладСамовывоза</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>РайонДоставкиОтправитель</name>
      <type>
        <types>CatalogRef.РайоныДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьАвтоЗаДень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьКилометража</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьТТНзаРНК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьТТНзаФактАдрес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДопРасходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КилометражЗаМкад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРазгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеДоставки</name>
      <type>
        <types>EnumRef.СостояниеДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерОтгрузки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопИнфо</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоставкаЗаНашСчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортныйОтдел</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерРейсаАнтор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДоставки</name>
      <type>
        <types>EnumRef.ПризнакиДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриемки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПриемки</name>
      <type>
        <types>CatalogRef.ВремяПриемки</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСФ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокументаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Распределена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВЛЗ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Распределил</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерЗагрузкиМашины</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерХодки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль2</name>
      <type>
        <types>CatalogRef.Автомобили</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВодительЗаказной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплектующих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пожелания</name>
    <attributes>
      <name>Отправитель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/КонтрольОбъемовЗОГ/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	ТЗ = Новый ТаблицаЗначений;
	Тз.Колонки.Добавить("Склад");
	ТЗ.Колонки.Добавить("ВидНакладной");
	ТЗ.Колонки.Добавить("НомерНакладной");
	ТЗ.Колонки.Добавить("НомерСтроки");
	ТЗ.Колонки.Добавить("Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаявкаНаОтгрузкуНакладные.Накладная
	|ИЗ
	|	Документ.ЗаявкаНаОтгрузку.Накладные КАК ЗаявкаНаОтгрузкуНакладные
	|ГДЕ
	|	ЗаявкаНаОтгрузкуНакладные.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ЗаявкаНаОтгрузкуНакладные.Ссылка.Проведен";
	Запрос.УстановитьПараметр("Дата1",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Дата2",КонецДня(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать();
	//Кухарь 31.10.18 начало
	//Ещё 1 отбивка по подозрительному объёму паллет
	ОтбивкаПлохойОбъемПаллеты="" ;
	//Кухарь 31.10.18 Конец
	Пока Выборка.Следующий() Цикл 
		Накладная = Выборка.Накладная;
		Если Ложь Тогда
			Накладная = Документы.РасходнаяНакладная.НайтиПоНомеру("");
		КонецЕсли;
		Если Накладная.Метаданные().имя = "РасходнаяНакладная" ИЛИ Накладная.Метаданные().имя = "Перемещение" Тогда
			//Кухарь 31.10.18 начало
			//Ещё 1 отбивка по подозрительному объёму паллет
			если Накладная.КоличествоПаллет>0 Тогда
				РасчОбъемПаллет=Накладная.ОбъемКоробов + 0.15 * Накладная.КоличествоПаллет;		
				если РасчОбъемПаллет>Накладная.ОбъемПаллет тогда
					ОтбивкаПлохойОбъемПаллеты=ОтбивкаПлохойОбъемПаллеты+?(Накладная.Метаданные().имя = "РасходнаяНакладная","РНК ","ПРМ ")+ Накладная.Номер+ " расчётный объём паллет больше фактического."+Символы.ВК
					+" Расчётный объем паллет - "+Строка(РасчОбъемПаллет)+". Фактический объем паллет - "+Строка(Накладная.ОбъемПаллет)+" м3."+Символы.ВК+Символы.ПС;
				КонецЕсли;
			КонецЕсли;		
			//Кухарь 31.10.18 Конец
			Для Каждого СтрокаТЧ Из Накладная.Товары Цикл
				Если СтрокаТЧ.Количество > 0 И СтрокаТЧ.Объем = 0 Тогда
					СтрокаТЗ = ТЗ.Добавить();
					СтрокаТЗ.Склад = Накладная.Склад;
					СтрокаТЗ.ВидНакладной = ?(Накладная.Метаданные().имя = "РасходнаяНакладная","РНК","ПРМ");
					СтрокаТЗ.НомерНакладной = Накладная.Номер;
					СтрокаТЗ.НомерСтроки = СтрокаТЧ.НомерСтроки;
					СтрокаТЗ.Номенклатура = СтрокаТЧ.Номенклатура;				
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	ТЗ.Сортировать("Склад,ВидНакладной,НомерНакладной,НомерСтроки");
	Если ТЗ.Количество() > 0 Тогда
		Текст = "";
		ТекСклад = Справочники.Склады.ПустаяСсылка();
		Для Каждого СтрокаТЗ ИЗ ТЗ Цикл
			Если ТекСклад = СтрокаТЗ.Склад Тогда		
					
				// Кухарь А.Ю.  24.08.2022 начало
				//На складе попросили добавить код номенклатуры в сообщение
				//Текст = Текст + "Не указан объем в  " +СтрокаТЗ.ВидНакладной +" "+СтрокаТЗ.НомерНакладной+". Номер строки: "+СтрокаТЗ.НомерСтроки + ". Номенклатура: "+СтрокаТЗ.Номенклатура +". Объем коробки: "+строка(СтрокаТЗ.Номенклатура.Родитель.ОбъемКоробки)+". Шт. в коробке: "+строка(СтрокаТЗ.Номенклатура.Родитель.ШтукВКоробке)+символы.ВК+"*************************************************"+Символы.ПС;	
				Текст = Текст + "Не указан объем в  " +СтрокаТЗ.ВидНакладной +" "+СтрокаТЗ.НомерНакладной+". Номер строки: "+СтрокаТЗ.НомерСтроки + ". Номенклатура: "+СтрокаТЗ.Номенклатура +" ("+СтрокаТЗ.Номенклатура.код+") "+". Объем коробки: "+строка(СтрокаТЗ.Номенклатура.Родитель.ОбъемКоробки)+". Шт. в коробке: "+строка(СтрокаТЗ.Номенклатура.Родитель.ШтукВКоробке)+символы.ВК+"*************************************************"+Символы.ПС;					
				// Кухарь А.Ю.  24.08.2022 конец
				
			Иначе
				Если НЕ ТекСклад.Пустая() Тогда		
					ПослатьПисьмо(Текст,ТекСклад);
					Текст = "";
				КонецЕсли;
				ТекСклад = СтрокаТЗ.Склад;
				//Текст = "Склад: "+ТекСклад+ символы.ПС;    +" ("+СтрокаТЗ.Номенклатура.код+") "
				// Кухарь А.Ю.  24.08.2022 начало
				//На складе попросили добавить код номенклатуры в сообщение
				// Текст = "Не указан объем в  " +СтрокаТЗ.ВидНакладной +" "+СтрокаТЗ.НомерНакладной+". Номер строки: "+СтрокаТЗ.НомерСтроки + ". Номенклатура: "+СтрокаТЗ.Номенклатура + ". Объем коробки: "+строка(СтрокаТЗ.Номенклатура.Родитель.ОбъемКоробки)+". Шт. в коробке: "+строка(СтрокаТЗ.Номенклатура.Родитель.ШтукВКоробке)+Символы.ВК+"*************************************************"+Символы.ПС;	
				Текст = "Не указан объем в  " +СтрокаТЗ.ВидНакладной +" "+СтрокаТЗ.НомерНакладной+". Номер строки: "+СтрокаТЗ.НомерСтроки + ". Номенклатура: "+СтрокаТЗ.Номенклатура +" ("+СтрокаТЗ.Номенклатура.код+") " + ". Объем коробки: "+строка(СтрокаТЗ.Номенклатура.Родитель.ОбъемКоробки)+". Шт. в коробке: "+строка(СтрокаТЗ.Номенклатура.Родитель.ШтукВКоробке)+Символы.ВК+"*************************************************"+Символы.ПС;	 
				// Кухарь А.Ю.  24.08.2022 конец					
			КонецЕсли;

		КонецЦикла;
		//Потом вернуть
		//ПослатьПисьмо(Текст,ТекСклад);
		
	КонецЕсли;
	
	//Кухарь 31.10.18 начало
	//Ещё 1 отбивка по подозрительному объёму паллет
	если ОтбивкаПлохойОбъемПаллеты<>"" тогда
		//Михайловский С. 20220712 -оповещения настраиваемыми делаем+++
		//вместо

		//СписокПолучателей=новый СписокЗначений;
		//СписокПолучателей.Добавить("semeikina@collant.ru");
		//СписокПолучателей.Добавить("gamova@collant.ru");
		//СписокПолучателей.Добавить("gimelshpak@collant.ru");
		//СписокПолучателей.Добавить("mamchenkov@collant.ru");
		//СписокПолучателей.Добавить("poryadochnov@collant.ru");
		//СписокПолучателей.Добавить("barinov@collant.ru");
		//СписокПолучателей.Добавить("chervyakov@collant.ru");
		//СписокПолучателей.Добавить("turchinskii@collant.ru");
		//СписокПолучателей.Добавить("krohin@collant.ru");
		//СписокПолучателей.Добавить("nikolaev@collant.ru");
		//СписокПолучателей.Добавить("ryabova@collant.ru");
		//// Кухарь А.Ю. 27.12.2021 начало
		//СписокПолучателей.Добавить("operatorschastsy@collant.ru");
		//// Кухарь А.Ю. 27.12.2021 конец
		//настраиваемый список
		СписокПолучателей=СформСписокПолучат(Справочники.ТипыРассылок.НеУказанОбъемВДокументе);
		//Михайловский С. 20220712 -оповещения настраиваемыми делаем---
		ПослатьТестовоеПисьмо(ОтбивкаПлохойОбъемПаллеты,СписокПолучателей,"Некорректный объём паллет.");
	КонецЕсли;
	//Кухарь 31.10.18 Конец
	
	
	
	
КонецПроцедуры

Процедура ПослатьПисьмо(Текст,Склад) Экспорт
	//возврат; //+++
	Если Склад.Подразделение.АдресЭлектроннойПочты = "" Тогда
		Возврат;
	КонецЕсли;
	
	попытка
		ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
		ЗаписатьВЛог("КонтрольОбъема","Отправление почты """+параметрыСеанса.Пользователь+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
	исключение
	конецпопытки;
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	
	// Кухарь А.Ю.  08.09.2022 начало
	//ПочтовыйПрофиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//ПочтовыйПрофиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//ПочтовыйПрофиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(ПочтовыйПрофиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//ПочтовыйПрофиль.Пользователь="*%*%*%";
	//ПочтовыйПрофиль.Пароль="*$*$*$";
	ПочтовыйПрофиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	ПочтовыйПрофиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	ПочтовыйПрофиль.ВремяОжидания      = 60; 
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	
	
	//крохин начало 15.04.2012
	//временно, до введения в подразделение ТЧ "электронная почта"
	//Сообщение.Получатели.Добавить("krohin@collant.ru");
	//Сообщение.Получатели.Добавить(Склад.Подразделение.АдресЭлектроннойПочты);
	//Сообщение.Получатели.Добавить("nikolaev@collant.ru");
	
	
	//Михайловский С. 20220712 -оповещения настраиваемыми делаем+++
	МП=Новый Массив;
	КС=Сообщение.Получатели.Количество();
	КСК=Сообщение.Копии.Количество();
	н=0;
	Пока н<КС Цикл
		ТП=Сообщение.Получатели.Получить(н).Адрес;
		Если МП.Найти(ТП)=неопределено Тогда
			МП.Добавить(ТП);
		КонецЕсли;	
		н=н+1;
	КонецЦикла;	
	
	н=0;
	Пока н<КСК Цикл
		ТП=Сообщение.Копии.Получить(н).Адрес;
		Если МП.Найти(ТП)=неопределено Тогда
			МП.Добавить(ТП);
		КонецЕсли;	
		н=н+1;
	КонецЦикла;
	
	//вместо
		
	//Одинцово 1
	//Если Склад.Подразделение.Код = "SKL-0001" Тогда
	//	Сообщение.Получатели.Добавить("nazarova@collant.ru");
	//	Сообщение.Получатели.Добавить("semeikina@collant.ru");
	//	Сообщение.Копии.Добавить("chervyakov@collant.ru");         
	//	Сообщение.Копии.Добавить("turchinskii@collant.ru");
	//	Сообщение.Копии.Добавить("krohin@collant.ru");
	//КонецЕсли;
	
	//настраиваемый список
	Если Склад.Подразделение.Код = "SKL-0001" Тогда
		ДопСписокПолучателей=СформСписокПолучат(Справочники.ТипыРассылок.НеУказанОбъемВДокументе,Справочники.Подразделения.НайтиПоКоду("SKL-0001"));
		Для Каждого ТЭл Из ДопСписокПолучателей Цикл
			Если МП.Найти(ТЭл.Значение)=неопределено Тогда
				МП.Добавить(ТЭл.Значение);
				Сообщение.Получатели.Добавить(ТЭл.Значение);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	//Михайловский С. 20220712 -оповещения настраиваемыми делаем---

	
	//Одинцово 3
	//Михайловский С. 20220712 -оповещения настраиваемыми делаем+++
	//вместо
	//Если Склад.Подразделение.Код = "SKL-0003" Тогда
	//	Сообщение.Получатели.Добавить("antonova@collant.ru");
	//	Сообщение.Копии.Добавить("kudryashov@collant.ru");
	//	Сообщение.Копии.Добавить("gluhov@collant.ru");
	//	Сообщение.Копии.Добавить("krohin@collant.ru");
	//КонецЕсли;
	
	//настраиваемый список
	Если Склад.Подразделение.Код = "SKL-0003" Тогда
		ДопСписокПолучателей=СформСписокПолучат(Справочники.ТипыРассылок.НеУказанОбъемВДокументе,Справочники.Подразделения.НайтиПоКоду("SKL-0003"));
		Для Каждого ТЭл Из ДопСписокПолучателей Цикл
			Если МП.Найти(ТЭл.Значение)=неопределено Тогда
				МП.Добавить(ТЭл.Значение);
				Сообщение.Получатели.Добавить(ТЭл.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	//Михайловский С. 20220712 -оповещения настраиваемыми делаем---
	
	//Шарапово
	//Михайловский С. 20220712 -оповещения настраиваемыми делаем+++
	//вместо
	//Если Склад.Подразделение.Код = "SSP-0135" Тогда
	//	Сообщение.Получатели.Добавить("gamova@collant.ru");
	//	Сообщение.Копии.Добавить("krohin@collant.ru");
	//КонецЕсли;
	
	//настраиваемый список
	Если Склад.Подразделение.Код = "SSP-0135" Тогда
		ДопСписокПолучателей=СформСписокПолучат(Справочники.ТипыРассылок.НеУказанОбъемВДокументе,Справочники.Подразделения.НайтиПоКоду("SSP-0135"));
		Для Каждого ТЭл Из ДопСписокПолучателей Цикл
			Если МП.Найти(ТЭл.Значение)=неопределено Тогда
				МП.Добавить(ТЭл.Значение);
				Сообщение.Получатели.Добавить(ТЭл.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	//Михайловский С. 20220712 -оповещения настраиваемыми делаем---
	//крохин конец 15.04.2012
	
	//крохин начало 21.10.2016
	//Часцы
	
	//Михайловский С. 20220712 -оповещения настраиваемыми делаем+++
	//вместо
	
	//Если Склад.Подразделение.Код = "SSP-0211" Тогда
	//	Сообщение.Получатели.Добавить("semeikina@collant.ru");
	//	Сообщение.Копии.Добавить("chervyakov@collant.ru");         
	//	Сообщение.Копии.Добавить("turchinskii@collant.ru");
	////	Сообщение.Копии.Добавить("krohin@collant.ru");
	//	Сообщение.Копии.Добавить("nikolaev@collant.ru");
	//	//крохин начало 26.07.2018
	//	Сообщение.Получатели.Добавить("gamova@collant.ru");
	//	Сообщение.Получатели.Добавить("gimelshpak@collant.ru");	
	//	//крохин конец 26.07.2018
	//	//Кухарь 26.07.18 начало
	//	Сообщение.Получатели.Добавить("poryadochnov@collant.ru");	
	////	Сообщение.Получатели.Добавить("barinov@collant.ru");		
	//	//Кухарь 26.07.18 конец
	//	
	//КонецЕсли;
	//настраиваемый список
	Если Склад.Подразделение.Код = "SSP-0211" Тогда
		ДопСписокПолучателей=СформСписокПолучат(Справочники.ТипыРассылок.НеУказанОбъемВДокументе,Справочники.Подразделения.НайтиПоКоду("SSP-0211"));
		Для Каждого ТЭл Из ДопСписокПолучателей Цикл
			Если МП.Найти(ТЭл.Значение)=неопределено Тогда
				МП.Добавить(ТЭл.Значение);
				Сообщение.Получатели.Добавить(ТЭл.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	//Михайловский С. 20220712 -оповещения настраиваемыми делаем---
	//крохин конец 21.10.2016
	
	Сообщение.Отправитель = "helpdesk@collant.ru";
	Сообщение.Тема = Склад.Наименование+". Не заполнен объем в документе.";
	Сообщение.Тексты.Добавить(Текст);
	
	Почта = Новый ИнтернетПочта(); 
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		Сообщить(ОписаниеОшибки()); 
		Возврат; 
	КонецПопытки; 
	
	Почта.Подключиться(ПочтовыйПрофиль);
	Почта.Послать(Сообщение);
	Почта.Отключиться();
	
	
КонецПроцедуры	

//Кухарь 31.10.18 начало
//Ещё 1 отбивка по подозрительному объёму паллет
Процедура ПослатьТестовоеПисьмо(Текст,СписокПолучателей,Тема) Экспорт
	
	
	попытка
		ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
		ЗаписатьВЛог("КонтрольОбъемаПаллет","Отправление почты """+параметрыСеанса.Пользователь+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
	исключение
	конецпопытки;
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	
	// Кухарь А.Ю.  08.09.2022 начало
	//ПочтовыйПрофиль.АдресСервераPOP3   = "srvmail2.collant.ru";
	//ПочтовыйПрофиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
	//ПочтовыйПрофиль.ПортPOP3           = 110; 
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	ЗаполнитьЗначенияСвойств(ПочтовыйПрофиль,ПараметрыПочты);	
	// Кухарь А.Ю.  08.09.2022 конец
	
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//ПочтовыйПрофиль.Пользователь="*%*%*%";
	//ПочтовыйПрофиль.Пароль="*$*$*$";
	ПочтовыйПрофиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	ПочтовыйПрофиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	ПочтовыйПрофиль.ВремяОжидания      = 60; 
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Для каждого ТекПолучатель из СписокПолучателей цикл
		Сообщение.Получатели.Добавить(ТекПолучатель.значение);
	КонецЦикла;
	Сообщение.Отправитель = "helpdesk@collant.ru";
	Сообщение.Тема = Тема;
	Сообщение.Тексты.Добавить(Текст);
	
	Почта = Новый ИнтернетПочта(); 
	Попытка 
		Почта.Подключиться(ПочтовыйПрофиль); 
	Исключение 
		Сообщить(ОписаниеОшибки()); 
		Возврат; 
	КонецПопытки; 
	
	Почта.Подключиться(ПочтовыйПрофиль);
	Почта.Послать(Сообщение);
	Почта.Отключиться();
	
	
КонецПроцедуры	
//Кухарь 31.10.18 Конец
